using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading;
using System.Threading.Tasks;

namespace Day10_1_Tamagotchi
{
    class Tamagotchi
    {
        string name;
        int growth = 0;
        int happiness = 0;
        int hunger = 0;
        int feedcount = 0;
        int playcount = 0;
        int cleancount = 0;
        int poopcount = 0;

        bool ishungry = false;
        bool isfull = false;
        bool isdirty = false;

        public string GetName()
        {
            return name;
        }
        public void SetName(string name)
        {
            this.name = name;
        }


        public int GetGrowth()
        {
            return growth;
        }
        public void SetGrowth(int growth)
        {
            this.growth = growth;
        }


        public int GetHappiness()
        {
            return happiness;
        }
        public void SetHappiness(int happiness)
        {
            this.happiness = happiness;
        }


        public int GetHunger()
        {
            return hunger;
        }
        public void SetHunger(int hunger)
        {
            this.hunger = hunger;
        }


        public int GetFeedCount()
        {
            return feedcount;
        }
        public void SetFeedCount(int feedcount)
        {
            this.feedcount = feedcount;
        }
        

        public int GetPlayCount()
        {
            return playcount;
        }
        public void SetPlayCount(int playcount)
        {
            this.playcount = playcount;
        }


        public int GetCleanCount()
        {
            return cleancount;
        }
        public void SetCleanCount(int cleancount)
        {
            this.cleancount = cleancount;
        }


        public int GetPoopCount()
        {
            return poopcount;
        }
        public void SetPoopCount(int poopcount)
        {
            this.poopcount = poopcount;
        }

        public bool GetIsHungry()
        {
            return ishungry;
        }
        public void SetIsHungry(bool ishungry)
        {
            this.ishungry = ishungry;
        }

        public bool GetIsFull()
        {
            return isfull;
        }
        public void SetIsFull(bool isfull)
        {
            this.isfull = isfull;
        }

        public bool GetIsDirty()
        {
            return isdirty;
        }
        public void SetIsDirty(bool isdirty)
        {
            this.isdirty = isdirty;
        }
        public void PrintTamagotchi()
        {
            int[] tamagotchi = new int[960];

            //알일 때
            int[] egg = new int[] { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                    0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                    0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,//25
                                    0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                    0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                    0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                    0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                    0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,//30
                                    0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                    0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                    0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                    0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                    0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,//35
                                    0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                    0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                    0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                    0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                    0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 };//40

            //유딩
            int[] tamagotchi1 = new int[] { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,//20
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,//25
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0,01,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,1,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,1,1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,//30
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,1,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,//35
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }; 

            //초딩
            int[] tamagotchi2 = new int[] { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,//20
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,1,0,0,1,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,1,0,0,1,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,//25
                                            0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,1,1,1,1,1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,//30
                                            0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,1,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,1,0,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,//35
                                            0,0,0,0,0,0,0,0,0,0,0,1,0,1,0,0,0,0,0,0,0,0,1,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }; 
            
            //고딩
            int[] tamagotchi3 = new int[] { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,//20
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,1,0,0,1,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,1,0,0,1,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,//25
                                            0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,1,1,1,1,1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,//30
                                            0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,1,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,1,0,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,//35
                                            0,0,0,0,0,0,0,0,0,0,0,1,0,1,0,0,0,0,0,0,0,0,1,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }; 

            //성인
            int[] tamagotchi4 = new int[] { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,//20
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,1,0,0,1,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,1,0,0,1,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,//25
                                            0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,1,1,1,1,1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,1,1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,//30
                                            0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,1,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,1,0,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,//35
                                            0,0,0,0,0,0,0,0,0,0,0,1,0,1,0,0,0,0,0,0,0,0,1,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                                            0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }; 


            if (growth == 0)
                tamagotchi = egg;
            else if (growth == 1)
                tamagotchi = tamagotchi1;
            else if (growth == 2)
                tamagotchi = tamagotchi2;
            else if (growth == 3)
                tamagotchi = tamagotchi3;
            else if (growth == 4)
                tamagotchi = tamagotchi4;

            for (int i = 0; i < tamagotchi.Length; i++)
            {

                if (tamagotchi[i] == 0) Console.Write(" ");
                else if (tamagotchi[i] == 1) Console.Write("█");
                if (i % 40 == 0) Console.WriteLine("");

            }
            Console.WriteLine("");
        }

        public void PrintStat()
        {
            Console.WriteLine("<<다마고치의 이름: " + name + ">>");
            Console.WriteLine("레벨: " + growth);
            Console.WriteLine("만족도: " + happiness);
            Console.WriteLine("포만감: " + hunger);

        }

        public void TakeCare(Tamagotchi tamagotchi, int a)
        {
            if (a == 1)
            {
                Console.WriteLine(tamagotchi.GetName() + "에게 밥을 줍니다!");
                tamagotchi.SetHunger(tamagotchi.GetHunger() + 20);
                tamagotchi.SetHappiness(tamagotchi.GetHappiness() + 15);
                tamagotchi.SetFeedCount(tamagotchi.GetFeedCount() + 1);
                tamagotchi.SetPoopCount(tamagotchi.GetPoopCount()+1);


                Console.WriteLine("밥주는 중.....");
                Thread.Sleep(2000);

                if (hunger < 80)
                {
                    SetIsHungry(false);
                    PrintTamagotchi();
                    PrintStat();
                    Console.WriteLine($"당신의 {name} 는/은 배가 불러 기분이 좋습니다!");
                    Console.WriteLine("===================");


                }
                else if (hunger >= 80)
                {

                    tamagotchi.SetIsFull(true);
                    PrintTamagotchi();
                    PrintStat();
                    Console.WriteLine($"당신의 {name} 은/는 포만감이 과해 시무룩해졌습니다...");
                    tamagotchi.SetHappiness(tamagotchi.GetHappiness() - 5);
                    Console.WriteLine("===================");

                }

            }
            else if (a == 2)
            {
                tamagotchi.SetIsFull(false);
                Console.WriteLine($"{name} 을/를 놀아줍니다!");
                tamagotchi.SetHappiness(tamagotchi.GetHappiness() + 20);
                tamagotchi.SetPlayCount(tamagotchi.GetPlayCount() + 1);
                tamagotchi.SetHunger(tamagotchi.GetHunger() - 20);

                Console.WriteLine("놀아주는 중.....");
                Thread.Sleep(2300);


                PrintTamagotchi();
                PrintStat();

                Console.WriteLine($"당신의 {name} 은/는 기분이 좋아졌습니다!");
                Console.WriteLine("===================");


            }
            else if (a == 3)
            {
                tamagotchi.SetIsDirty(false);
                Console.WriteLine($"{name}의 방을 치워줍니다!");
                tamagotchi.SetHappiness(tamagotchi.GetHappiness() + 20);
                tamagotchi.SetCleanCount(tamagotchi.GetCleanCount() + 1);
                tamagotchi.SetPoopCount(tamagotchi.GetPoopCount()-1);

                Console.WriteLine("청소중.....");
                Thread.Sleep(2400);

                PrintTamagotchi();
                PrintStat();

                Console.WriteLine($"당신의 {tamagotchi.GetName()} 은/는 방이 깨끗해져 기분이 좋습니다!");
                Console.WriteLine("===================");

            }

            if (hunger <= 0)
            {
                SetIsHungry(true);
                PrintTamagotchi();
                PrintStat();
                Console.WriteLine($"당신의 {name} 이/가 배고파합니다...");
                tamagotchi.SetHappiness(tamagotchi.GetHappiness() - 5);
                Console.WriteLine("===================");
            }
            if (poopcount == 2)
            {

                Console.WriteLine($"{name} 의 방이 더러워지고 있습니다! 청소해줘야 할 것 같습니다...");
                Console.WriteLine("===================");
                tamagotchi.SetHappiness(tamagotchi.GetHappiness() - 5);

            }
            else if(poopcount >= 3)
            {
                tamagotchi.SetIsDirty(true);
                tamagotchi.SetHappiness(tamagotchi.GetHappiness() - 5);
            }

        }

        public void CheckGrowth()
        {
            if (happiness >= 100)
            {
                SetHappiness(happiness - 100);
                growth++;
                PrintTamagotchi();
                Console.WriteLine($"☆★☆★ {name} 이/가 성장하였습니다! ☆★☆★");
                PrintGrowth();

            }
        }

        public void PrintGrowth()
        {
            if (growth == 0)
            {
                Console.WriteLine($"현재 {name} 은/는 아직 알 상태입니다!");
            }
            else if (growth == 1)
            {
                Console.WriteLine($"현재 {name} 은/는 유치원생입니다!");
            }
            else if (growth == 2)
            {
                Console.WriteLine($"현재 {name} 은/는 초등학생입니다!");
            }
            else if (growth == 3)
            {
                Console.WriteLine($"현재 {name} 은/는 고등학생입니다!");
            }
            else
            {
                Console.WriteLine($"당신의 {name} 은/는 어느덧 성인입니다!");
            }
        }

        public void PrintCount()
        {

            Console.Write($"지금까지 밥 준 횟수: {GetFeedCount()}\n");
            Console.Write($"지금까지 놀아준 횟수: {GetPlayCount()} \n");
            Console.Write($"지금까지 청소해 준 횟수: {GetCleanCount()} \n");
            Console.WriteLine("===================");

        }

    }


    internal class Program
    {
        static void Main(string[] args)
        {
            Console.OutputEncoding = System.Text.Encoding.UTF8;
            //=====================================================

            Tamagotchi tamagotchi = new Tamagotchi();

            tamagotchi.PrintTamagotchi();

            Console.Write("다마고치의 이름을 지어주세요: ");
            tamagotchi.SetName(Console.ReadLine());
            Console.Clear();

            int action;

            while (true)
            {


                Console.Write("무엇을 하시겠습니다? (1)밥주기 (2)놀아주기 (3)방 치워주기 (0)게임종료 : ");
                action = int.Parse(Console.ReadLine());


                if (action == 0)
                {

                    Console.WriteLine("게임을 종료합니다.");
                    Thread.Sleep(500);
                    Console.WriteLine("종료 중....");
                    Thread.Sleep(1200);
                    break;

                }

                bool needFeed = tamagotchi.GetIsHungry();
                bool needMove = tamagotchi.GetIsFull();
                bool needClean = tamagotchi.GetIsDirty();

                bool comboChecked = false;

                if (needFeed && needClean)
                {
                    comboChecked = true;
                    if (action != 1 && action != 3)
                    {
                        Console.WriteLine($"{tamagotchi.GetName()}에게 밥을 주거나 또는 청소를 해주어야 합니다!!!");
                        Console.WriteLine("===================");
                        continue;
                    }
                }
                else if (needFeed && needMove)
                {
                    comboChecked = true;
                    if (action != 1 && action != 2)
                    {
                        Console.WriteLine($"{tamagotchi.GetName()}에게 밥을 주거나 놀아줘야 합니다!!!");
                        Console.WriteLine("===================");
                        continue;
                    }
                }
                else if (needMove && needClean)
                {
                    comboChecked = true;
                    if (action != 2 && action != 3)
                    {
                        Console.WriteLine($"{tamagotchi.GetName()}을/를 놀아주거나 청소를 해주어야 합니다!!!");
                        Console.WriteLine("===================");
                        continue;
                    }
                }

                if (!comboChecked)
                {
                    if (action != 1 && needFeed)
                    {
                        Console.WriteLine($"{tamagotchi.GetName()}에게 밥을 주어야 합니다!!!");
                        Console.WriteLine("===================");
                        continue;
                    }
                    if (action != 2 && needMove)
                    {
                        Console.WriteLine($"{tamagotchi.GetName()}은/는 배가 불러 움직여야 합니다!!!");
                        Console.WriteLine("===================");
                        continue;
                    }
                    if (action != 3 && needClean)
                    {
                        Console.WriteLine($"{tamagotchi.GetName()}의 방을 청소해줘야 합니다!!!");
                        Console.WriteLine("===================");
                        continue;
                    }
                }

                if (action == 3 && tamagotchi.GetPoopCount() == 0)
                {
                    Console.WriteLine($"{tamagotchi.GetName()}의 방은 이미 깨끗합니다!!!");
                    Console.WriteLine("===================");
                    continue;
                }

                tamagotchi.TakeCare(tamagotchi, action);
                tamagotchi.PrintStat();
                tamagotchi.CheckGrowth();
                tamagotchi.PrintCount();
            }

        }
    }
}
